"""
0. HOT KEYS for PyCharm:
    
    1) F6 - изменение расположения файла + переименование файла
    2) Tab - табуляция
    3) Home, End - переход в НАЧАЛО/КОНЕЦ строки
    
    0.1. Комбинации с CTRL:
    3) Ctrl+Alt+L - форматирование по PEP-8
    4) Ctrl+/ - быстрое комментирование
    5) Ctrl+W - быстрое выделение
    6) Ctrl+Z - отмена последнего действия
    7) Ctrl+Left/Right - переход к НАЧАЛУ/КОНЦУ слова 
    8) Ctrl+Home, Ctrl+End - переход в НАЧАЛО/КОНЕЦ файла
    9) Ctrl+Shift+Left/Right - выделение + переход к НАЧАЛУ/КОНЦУ слова
    10) Ctrl+Backspace - новая строка + курсор остается на месте
    11) Ctrl+Up/Down - передвижение экрана ВВЕРХ/ВНИЗ 
    12) Ctrl+Backspace/Delete - удаление слова СЛЕВА/СПРАВА
    13) Ctrl+Shift+Up/Down - перемещение строк ВВЕРХ/ВНИЗ 
    
    0.2. Комбинации с SHIFT:
    14) Shift+Left/Right - выделение 
    15) Shift+Up/Down - выделение + переход на строку ВВЕРХ/ВНИЗ
    16) Shift+Ctrl+Left/Right - выделение + переход к НАЧАЛУ/КОНЦУ слова
    17) Shift+Home/End - выделение + переход к НАЧАЛУ/КОНЦУ строки
    18) Shift+Ctrl+Up/Down - перемещение строк ВВЕРХ/ВНИЗ
    19) Shift+Alt+Up/Down - перемещение строки ВВЕРХ/ВНИЗ
    20) Shift+F6 - переименование переменных
    21) Shift+Backspace - создание + переход на следующую строку 
    
    0.3. Комбинации с ALT:
    22) Alt+Ctrl+L - форматирование по PEP-8
    23) Alt+Shift+Up/Down - перемещение строки ВВЕРХ/ВНИЗ
    24) Alt+LBM - множество курсоров
    
    
1. Комментарии:

    1) """"""
    2) #


2. Встроенные функции языка:

    1) print() - вывод в терминал
    2) sep="" - разделитель
    3) end="" - отмена автоматического переноса
    4) \n - перевод на новую строку
    5) \ - позволяет не котировать следующий символ (Например: \\, \'. Вывод: \, ')
    6) \t - табуляция(4 пробела) 
    7) +, -, *, /, **, //, %
    8) min(), max() - нахождение минимального и максимального значений соответственно
    9) abs() - модуль числа
    10) >, >=, <, <=, ==, != - операции сравнения
    11) and, or, not - логические операции
    12) bool(), int(), str(), float() - приведение к различным типам данных
    13) pow(a, b) - возведение числа a в степень числа b
    14) round() - округление числа по правилам арифметики
    15) input() - получение данных
    16) del - удаление переменной
    17) +=, -=, *=, /=, **= //=, %= - сокращенная запись
    18) ord() - возвращает код символа из таблицы кодировки
    19) len() - определение длины строки, списка, кортежа и т.д.
    
    
3. Условные операторы:

    Пример условной конструкции:
        if 0 <= num < 100: 
        elif num > 100:
        else:
    
    1) if - начало условной конструкции
    2) elif (сокр. от else if - "иначе если") - проверяется в том случае, если предыдущее условие не было выполнено
    3) else - выполняется только если ни одно из предыдущих условий не выполнено
    
"""