"""
0. HOT KEYS for PyCharm:
    
    18) F6 - изменение расположения файла + переименование файла
    7) Tab - табуляция
    1) Ctrl+/ - быстрое комментирование
    3) Ctrl+Alt+L - форматирование по PEP-8
    4) Ctrl+Z - отмена последнего действия
    5) Ctrl+End, Ctrl+Home - переход в КОНЕЦ/НАЧАЛО файла
    6) End, Home - переход в КОНЕЦ/НАЧАЛО строки
    10) Shift+Backspace - создание + переход на следующую строку 
    11) Ctrl+Backspace - новая строка + курсор остается на месте
    
    2) Ctrl+W - быстрое выделение
    8) Shift+F6 - переименование переменных
    9) Alt+LBM - множество курсоров
    12) Ctrl+Left/Right - переход к НАЧАЛУ/КОНЦУ слова соотвественно 
    13) Shift+Up/Down - выделение + переход на строку ВВЕРХ/ВНИЗ
    14) Ctrl+Up/Down - передвижение экрана ВВЕРХ/ВНИЗ 
    15) Shift+Left/Right - выделение 
    16) Shift+Ctrl+Left/Right - выделение + переход к НАЧАЛУ/КОНЦУ слова
    17) Shift+Alt+Up/Down - перемещение строки ВВЕРХ/ВНИЗ
    19) Shift+Home/End - переход к НАЧАЛУ/КОНЦУ строки + выделение
    
1. Комментарии:

    1) """"""
    2) #


2. Встроенные функции языка:

    1) print() - вывод в терминал
    2) sep="" - разделитель
    3) end="" - отмена автоматического переноса
    4) \n - перевод на новую строку
    5) \ - позволяет не котировать следующий символ (Например: \\, \'. Вывод: \, ')
    6) \t - табуляция(4 пробела) 
    7) +, -, *, /, **, //, %
    8) min(), max() - нахождение минимального и максимального значений соотвественно
    9) abs() - модуль числа
    10) >, >=, <, <=, ==, != - операции сравнения
    11) and, or, not - логические операции
    12) bool(), int(), str(), float() - приведение к различным типам данных
    13) pow(a, b) - возведение числа a в степень числа b
    14) round() - округление числа по правилам арифметики
    15) input() - получение данных
    16) del - удаление переменной
    17) +=, -=, *=, /=, **= //=, %= - сокращенная запись
    18) ord() - возвращает код символа из ьаблицы кодировки
    19) len() - определение длины строки, списка, кортежа и т.д.
    
    
3. Условные операторы:

    Пример условной конструкции:
        if 0 <= a < 100:
        elif a > 100:
        else:
    
    1) if - начало условной конструкции
    2) elif (сокр. от else if - "иначе если") - проверяется в том случае, если предыущее условие не было выполнено
    3) else - выполняется только если ни одно из предыдущих условий не выполнено
    
"""